Show / Hide Table of Contents
Class MemberHiddenCheckClient
Inheritance
System.Object
System.ServiceModel.ClientBase<IMemberHiddenCheck>
MemberHiddenCheckClient
Implements
System.ServiceModel.ICommunicationObject
System.IDisposable
IMemberHiddenCheck
Inherited Members
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.GetDefaultValueForInitialization<T>()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.Open()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.Abort()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.Close()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.DisplayInitializationUI()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.CreateChannel()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.IDisposable.Dispose()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Open(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Close(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginClose(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginClose(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.EndClose(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginOpen(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginOpen(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.EndOpen(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.InvokeAsync(System.ServiceModel.ClientBase.BeginOperationDelegate<>, System.Object[], System.ServiceModel.ClientBase.EndOperationDelegate<>, System.Threading.SendOrPostCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.Channel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.CacheSetting
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.ChannelFactory
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.ClientCredentials
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.State
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.InnerChannel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.Endpoint
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Closed
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Closing
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Faulted
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Opened
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IMemberHiddenCheck>.System.ServiceModel.ICommunicationObject.Opening
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class MemberHiddenCheckClient : ClientBase<IMemberHiddenCheck>, ICommunicationObject, IDisposable, IMemberHiddenCheck
Constructors
Improve this Doc   View Source
MemberHiddenCheckClient(Binding, EndpointAddress)
Declaration
public MemberHiddenCheckClient(Binding binding, EndpointAddress remoteAddress)
Parameters
 Type |  Name |  Description
 System.ServiceModel.Channels.Binding |  binding
 System.ServiceModel.EndpointAddress |  remoteAddress
Properties
Improve this Doc   View Source
HiddenCalculatorId
Declaration
public static int HiddenCalculatorId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Service
Declaration
protected IMemberHiddenCheck Service { get; }
Property Value
 Type |  Description
 IMemberHiddenCheck
Methods
Improve this Doc   View Source
Calculate(Int32)
Declaration
public string Calculate(int subStructureId)
Parameters
 Type |  Name |  Description
 System.Int32 |  subStructureId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
Cancel()
Declaration
public void Cancel()
Improve this Doc   View Source
CloseProject()
Declaration
public void CloseProject()
Improve this Doc   View Source
OpenProject(String)
Declaration
public void OpenProject(string projectLocation)
Parameters
 Type |  Name |  Description
 System.String |  projectLocation
Implements
 System.ServiceModel.ICommunicationObject
 System.IDisposable
 IMemberHiddenCheck
 Improve this Doc
 View Source